#pragma once

class Helpers
{
/*
==============================================================================================

开源声明： 
，本着一起提高网络安全水平研究了一下UE4游戏的安全，把现有的研究成果和大家分享一下。本人申明，本套源码仅用于开源学习，禁止将本套源码用作任何商业用途和非法用途，如果你使用本套源码，代表已经同意了此声明，所造成的任何后果和损失，由使用者自行承担。

技术交流QQ群782282356
==============================================================================================

*/
public:
	// HOOK类
	static void HookFunction(PVOID* oFunction, PVOID pDetour);
	static void UnHookFunction(PVOID* oFunction, PVOID pDetour);

	// 窗口信息获取类
	static BOOL		CALLBACK EnumWindowsCallback(HWND hWnd, LPARAM lParam);
	static HWND		GetCurrentWindowHandle();
	static DWORD	GetCurrentProcessID();
/*
==============================================================================================

开源声明： 
，本着一起提高网络安全水平研究了一下UE4游戏的安全，把现有的研究成果和大家分享一下。本人申明，本套源码仅用于开源学习，禁止将本套源码用作任何商业用途和非法用途，如果你使用本套源码，代表已经同意了此声明，所造成的任何后果和损失，由使用者自行承担。

技术交流QQ群782282356
==============================================================================================

*/

};

